/*
 * Licensed to the OpenAirInterface (OAI) Software Alliance under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.
 * The OpenAirInterface Software Alliance licenses this file to You under
 * the OAI Public License, Version 1.1  (the "License"); you may not use this file
 * except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *      http://www.openairinterface.org/?page_id=698
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *-------------------------------------------------------------------------------
 * For more information about the OpenAirInterface (OAI) Software Alliance:
 *      contact@openairinterface.org
 */



#ifndef IE_DEFINITIONS_READER_H
#define IE_DEFINITIONS_READER_H

/* Generated by flatcc 0.6.1-dev FlatBuffers schema compiler for C by dvide.com */

#ifndef FLATBUFFERS_COMMON_READER_H
#include "flatbuffers_common_reader.h"
#endif
#include "flatcc/flatcc_flatbuffers.h"
#ifndef __alignas_is_defined
#include <stdalign.h>
#endif
#include "flatcc/flatcc_prologue.h"
#ifndef flatbuffers_identifier
#define flatbuffers_identifier 0
#endif

    switch (value) {
    case e2ap_RicControlStatus_Success: return "Success";
    case e2ap_RicControlStatus_Rejected: return "Rejected";
    case e2ap_RicControlStatus_Failed: return "Failed";
    default: return "";
    }
}

static inline int e2ap_RicControlStatus_is_known_value(e2ap_RicControlStatus_enum_t value)
{
    switch (value) {
    case e2ap_RicControlStatus_Success: return 1;
    case e2ap_RicControlStatus_Rejected: return 1;
    case e2ap_RicControlStatus_Failed: return 1;
    default: return 0;
    }
}

typedef uint8_t e2ap_E2NodeCompType_enum_t;
__flatbuffers_define_integer_type(e2ap_E2NodeCompType, e2ap_E2NodeCompType_enum_t, 8)
#define e2ap_E2NodeCompType_gNB ((e2ap_E2NodeCompType_enum_t)UINT8_C(0))
#define e2ap_E2NodeCompType_gNB_CU_UP ((e2ap_E2NodeCompType_enum_t)UINT8_C(1))
#define e2ap_E2NodeCompType_gNB_DU ((e2ap_E2NodeCompType_enum_t)UINT8_C(2))
#define e2ap_E2NodeCompType_en_gNB ((e2ap_E2NodeCompType_enum_t)UINT8_C(3))
#define e2ap_E2NodeCompType_eNB ((e2ap_E2NodeCompType_enum_t)UINT8_C(4))
#define e2ap_E2NodeCompType_ng_eNB ((e2ap_E2NodeCompType_enum_t)UINT8_C(5))

static inline const char *e2ap_E2NodeCompType_name(e2ap_E2NodeCompType_enum_t value)
{
    switch (value) {
    case e2ap_E2NodeCompType_gNB: return "gNB";
    case e2ap_E2NodeCompType_gNB_CU_UP: return "gNB_CU_UP";
    case e2ap_E2NodeCompType_gNB_DU: return "gNB_DU";
    case e2ap_E2NodeCompType_en_gNB: return "en_gNB";
    case e2ap_E2NodeCompType_eNB: return "eNB";
    case e2ap_E2NodeCompType_ng_eNB: return "ng_eNB";
    default: return "";
    }
}

static inline int e2ap_E2NodeCompType_is_known_value(e2ap_E2NodeCompType_enum_t value)
{
    switch (value) {
    case e2ap_E2NodeCompType_gNB: return 1;
    case e2ap_E2NodeCompType_gNB_CU_UP: return 1;
    case e2ap_E2NodeCompType_gNB_DU: return 1;
    case e2ap_E2NodeCompType_en_gNB: return 1;
    case e2ap_E2NodeCompType_eNB: return 1;
    case e2ap_E2NodeCompType_ng_eNB: return 1;
    default: return 0;
    }
}

typedef uint8_t e2ap_E2NodeCompConfUpdateAckOutcome_enum_t;
__flatbuffers_define_integer_type(e2ap_E2NodeCompConfUpdateAckOutcome, e2ap_E2NodeCompConfUpdateAckOutcome_enum_t, 8)
#define e2ap_E2NodeCompConfUpdateAckOutcome_Success ((e2ap_E2NodeCompConfUpdateAckOutcome_enum_t)UINT8_C(0))
#define e2ap_E2NodeCompConfUpdateAckOutcome_Failure ((e2ap_E2NodeCompConfUpdateAckOutcome_enum_t)UINT8_C(1))

static inline const char *e2ap_E2NodeCompConfUpdateAckOutcome_name(e2ap_E2NodeCompConfUpdateAckOutcome_enum_t value)
{
    switch (value) {
    case e2ap_E2NodeCompConfUpdateAckOutcome_Success: return "Success";
    case e2ap_E2NodeCompConfUpdateAckOutcome_Failure: return "Failure";
    default: return "";
    }
}

static inline int e2ap_E2NodeCompConfUpdateAckOutcome_is_known_value(e2ap_E2NodeCompConfUpdateAckOutcome_enum_t value)
{
    switch (value) {
    case e2ap_E2NodeCompConfUpdateAckOutcome_Success: return 1;
    case e2ap_E2NodeCompConfUpdateAckOutcome_Failure: return 1;
    default: return 0;
    }
}


struct e2ap_RicRequestId {
    alignas(2) uint16_t ricRequestorId;
    alignas(2) uint16_t ricInstanceId;
};
static_assert(sizeof(e2ap_RicRequestId_t) == 4, "struct size mismatch");

static inline const e2ap_RicRequestId_t *e2ap_RicRequestId__const_ptr_add(const e2ap_RicRequestId_t *p, size_t i) { return p + i; }
static inline e2ap_RicRequestId_t *e2ap_RicRequestId__ptr_add(e2ap_RicRequestId_t *p, size_t i) { return p + i; }
static inline e2ap_RicRequestId_struct_t e2ap_RicRequestId_vec_at(e2ap_RicRequestId_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t e2ap_RicRequestId__size(void) { return 4; }
static inline size_t e2ap_RicRequestId_vec_len(e2ap_RicRequestId_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(e2ap_RicRequestId)

__flatbuffers_define_struct_scalar_field(e2ap_RicRequestId, ricRequestorId, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(e2ap_RicRequestId, ricInstanceId, flatbuffers_uint16, uint16_t)

struct e2ap_E2NCId {
    alignas(8) uint64_t id;
};
static_assert(sizeof(e2ap_E2NCId_t) == 8, "struct size mismatch");

static inline const e2ap_E2NCId_t *e2ap_E2NCId__const_ptr_add(const e2ap_E2NCId_t *p, size_t i) { return p + i; }
static inline e2ap_E2NCId_t *e2ap_E2NCId__ptr_add(e2ap_E2NCId_t *p, size_t i) { return p + i; }
static inline e2ap_E2NCId_struct_t e2ap_E2NCId_vec_at(e2ap_E2NCId_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t e2ap_E2NCId__size(void) { return 8; }
static inline size_t e2ap_E2NCId_vec_len(e2ap_E2NCId_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(e2ap_E2NCId)

__flatbuffers_define_struct_scalar_field(e2ap_E2NCId, id, flatbuffers_uint64, uint64_t)

struct e2ap_Plmn {
    alignas(2) uint16_t mcc;
    alignas(2) uint16_t mnc;
    alignas(1) uint8_t mnc_digit_length;
};
static_assert(sizeof(e2ap_Plmn_t) == 6, "struct size mismatch");

static inline const e2ap_Plmn_t *e2ap_Plmn__const_ptr_add(const e2ap_Plmn_t *p, size_t i) { return p + i; }
static inline e2ap_Plmn_t *e2ap_Plmn__ptr_add(e2ap_Plmn_t *p, size_t i) { return p + i; }
static inline e2ap_Plmn_struct_t e2ap_Plmn_vec_at(e2ap_Plmn_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t e2ap_Plmn__size(void) { return 6; }
static inline size_t e2ap_Plmn_vec_len(e2ap_Plmn_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(e2ap_Plmn)

__flatbuffers_define_struct_scalar_field(e2ap_Plmn, mcc, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(e2ap_Plmn, mnc, flatbuffers_uint16, uint16_t)
__flatbuffers_define_struct_scalar_field(e2ap_Plmn, mnc_digit_length, flatbuffers_uint8, uint8_t)

struct e2ap_EngNB {
    alignas(4) e2ap_Plmn_t plmn;
    alignas(4) uint32_t id;
};
static_assert(sizeof(e2ap_EngNB_t) == 12, "struct size mismatch");

static inline const e2ap_EngNB_t *e2ap_EngNB__const_ptr_add(const e2ap_EngNB_t *p, size_t i) { return p + i; }
static inline e2ap_EngNB_t *e2ap_EngNB__ptr_add(e2ap_EngNB_t *p, size_t i) { return p + i; }
static inline e2ap_EngNB_struct_t e2ap_EngNB_vec_at(e2ap_EngNB_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t e2ap_EngNB__size(void) { return 12; }
static inline size_t e2ap_EngNB_vec_len(e2ap_EngNB_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(e2ap_EngNB)

__flatbuffers_define_struct_struct_field(e2ap_EngNB, plmn, e2ap_Plmn_struct_t)
__flatbuffers_define_struct_scalar_field(e2ap_EngNB, id, flatbuffers_uint32, uint32_t)

struct e2ap_NgeNB {
    alignas(4) e2ap_Plmn_t plmn;
    alignas(4) uint32_t id;
};
static_assert(sizeof(e2ap_NgeNB_t) == 12, "struct size mismatch");

static inline const e2ap_NgeNB_t *e2ap_NgeNB__const_ptr_add(const e2ap_NgeNB_t *p, size_t i) { return p + i; }
static inline e2ap_NgeNB_t *e2ap_NgeNB__ptr_add(e2ap_NgeNB_t *p, size_t i) { return p + i; }
static inline e2ap_NgeNB_struct_t e2ap_NgeNB_vec_at(e2ap_NgeNB_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t e2ap_NgeNB__size(void) { return 12; }
static inline size_t e2ap_NgeNB_vec_len(e2ap_NgeNB_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(e2ap_NgeNB)

__flatbuffers_define_struct_struct_field(e2ap_NgeNB, plmn, e2ap_Plmn_struct_t)
__flatbuffers_define_struct_scalar_field(e2ap_NgeNB, id, flatbuffers_uint32, uint32_t)

struct e2ap_ENB {
    alignas(4) e2ap_Plmn_t plmn;
    alignas(4) uint32_t id;
};
static_assert(sizeof(e2ap_ENB_t) == 12, "struct size mismatch");

static inline const e2ap_ENB_t *e2ap_ENB__const_ptr_add(const e2ap_ENB_t *p, size_t i) { return p + i; }
static inline e2ap_ENB_t *e2ap_ENB__ptr_add(e2ap_ENB_t *p, size_t i) { return p + i; }
static inline e2ap_ENB_struct_t e2ap_ENB_vec_at(e2ap_ENB_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t e2ap_ENB__size(void) { return 12; }
static inline size_t e2ap_ENB_vec_len(e2ap_ENB_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(e2ap_ENB)

__flatbuffers_define_struct_struct_field(e2ap_ENB, plmn, e2ap_Plmn_struct_t)
__flatbuffers_define_struct_scalar_field(e2ap_ENB, id, flatbuffers_uint32, uint32_t)


struct e2ap_RicRequest_table { uint8_t unused__; };

static inline size_t e2ap_RicRequest_vec_len(e2ap_RicRequest_vec_t vec)
__flatbuffers_vec_len(vec)
static inline e2ap_RicRequest_table_t e2ap_RicRequest_vec_at(e2ap_RicRequest_vec_t vec, size_t i)
